namespace EnemyClicker
{
	public static class EnemyStatisticOnLevels
	{
		//Количества уровней в игре
		public static int level_count_without_zero = 30;
		private static int level_count_full = 31;

		//Здоровье противников
		public static int[] EnemiesHealth = new int[]
		{
			0,//Нолевой уровень
            10, 30, 64, 125, 180,//1   5
            260, 410, 560, 870, 1350,//2 10
            1800, 2300, 2800, 3200, 3500,//3    15
            4200, 4800, 10000, 15000, 25000,//4  20
            60000, 250000, 500000, 2500000, 5000000,//5  25
            7500000, 14000000, 27500000, 40000000, 50000000//6  30

        };

		//Награда за убийство противников
		public static int[] EnemiesReward = new int[]
		{
			0,//Нолевой уровень
            1,     2,   3,   5,   7,//1   5
            9,    11,  13,  16,  19,//2  10
            22,   25,  28,  32,  36,//3  15
            41,   46,  51,  57,  63,//4  20
            70,   77,  84,  92, 100,//5  25
            110, 120, 130, 145, 160 //6  30

        };

		//Защита противников
		public static int[] EnemiesDefend = new int[]
		{
			0,//Нолевой уровень
            0,   0,  0,  1,  1,//1  5
            2,   2,  2,  3,  3,//2  10
            4,   4,  5,  5,  6,//3  15
            6,   7,  7,  8,  9,//4  20
            10, 11, 12, 13, 14,//5  25
            15, 16, 17, 19, 21,//6  30

        };

		//Урон противников
		public static int[] EnemiesStreight = new int[]
		{
			0,//Нолевой уровень
            1,   2,  3,  4, 5,//1  5
            6,   7,  8,  9, 10,//2  10
            12, 14, 16, 18, 20,//3  15
            22, 24, 26, 28, 30,//4  20
            33, 36, 39, 42, 45,//5  25
            48, 51, 54, 57, 60,//6  30

        };
	}
}
